{
  "title": "Mentorship: Founding Member of WCE Codepals",
  "logo": "images/wce_codepals_logo.png",
  "name": "Mentorship: Founding Member of WCE Codepals",
  "date": "2020",
  "body": "<div class='row m-2'><div style=\"text-align: center; width:100%;\"><img src=\"images/wce_codepals_logo.png\" alt=\"SITAC Official Logo\" /></div><div class=\"m-2 mt-4\">We are a bunch of tech enthusiasts striving for each other’s development. It’s a community by the students and for the students.<ul> <li><strong>Official Website: </strong><a href='https://wce-codepals.github.io/' target='_blank' rel='noopener noreferer'>https://wce-codepals.github.io/</a></li> <li><strong>Github Organization: </strong><a href='https://github.com/wce-codepals' target='_blank' rel='noopener noreferer'>@wce-codepals</a></li></ul></div><div class=\"m-2 mt-4\">Dear Walchandite, <br><br>Do you like problem-solving?<br>Do you believe in Open Source?<br>Do you believe in self-satisfaction?<br>Do you believe in collaborative learning?<br>Do you want to break the loop on procrastination?<br>Do you believe that technology can bring transformation?<br>Do you have the burning desire to make this world a better place? Are you self-motivated and no any monetary benefit attracts you?<br><br>If you have answered yes to any of the questions above this letter is for you.<br><br>We hope you're doing well. We're almost at the end of the semester and it's about evaluating what we have achieved and it's the time to plan for the upcoming semester to grow further more.<br><br>Undoubtedly here at WCE, we have great people with profound ideas, intelligence and widespread skillset but somewhere we're lacking in terms of collaborative learning. People tend to do software projects just for sake of mini-project and nothing else. Many people can't solve simple algorithmic problems and here we fail badly in competition with other students. We think the way we are oriented to Programming or entire Computer Science World is a bit improper. It's seen people don't practice problem-solving just because they aren't getting the kick as a proper start to do so.<br><br>Almost everyone here has excellent intellectual level it's just that we're lacking a culture where the intelligence is channelized to achieve greater things.<br><br>Here at WCE people have already started great things:<ul><li>We had 10+ teams for ACM ICPC this year, 3 out of them have made to onsite.</li><li>Many teams are participating in Hackathons and such Project Competitions.</li><li>People are learning new technologies and making good projects.</li><li>We can see participation on sport programming websites has increased in last 2years significantly.</li></ul><br><strong>We can see a serious problem here that a very small group of people are doing all these things and a mass left out.</strong><br><br><strong>We envision a culture where people learn collaboratively.</strong> We start with basics of computer science, problem-solving and reach a stage where everyone will be solving some of the really complex problems and delivering technology solutions.<br><br>This includes learning Data Structures, Algorithms, Software Application Development (Mobile/Web/Desktop). All of this will strictly follow standard practices. If you find this intriguing and if you can help this happen please join us. It's not going to be a club, here we don’t have any hierarchy and formalities that limit our productivity.<br><br>We’ll have semester-long tracks to be completed and in this journey, we’ll have really a great experience of learning.<br><br>Tracks we’ll have:<ul><li>Sport Programming</li><li>Web Development</li><li>Mobile Development</li><li>Desktop Development</li><li>System Level Programming</li><li>Networking and Security</li><li>IOT and Embedded Systems</li><li>Data Science</li><li>Artficial Intelligence</li></ul><br>Please find Details about some of the tracks below, we’re still working on other tracks.<br><br><strong>We need your suggestions, this December a dedicated team will work on plans for upcoming semester. If you have anything for us please drop us a mail here at wcecodepals@gmail.com.</strong><br><br>Regards,<br>WCE CODEPALS<br><i>Every day every hour turn the pain into power.</i></div></div>",
  "footer": ""
}