{
  "data_position": "7",
  "publication_year": "Accepted in June 2021",
  "publication_title": "Finding all Edges on any Smallest Route connecting two nodes of a Directed Acyclic Graph using Parallel Computing",
  "article_type": "Conference Article",
  "authors": "<strong>Deepak Ahire</strong>, Kiran Kamble, Omkar Jadhav, Shubham Katakdhond",
  "publishing_authority_name": "Innovations in Computer Science and Engineering, Proceedings of 9th ICICSE, Springer Singapore",
  "host_version_html_name": "Springer Version",
  "host_version": "https://link.springer.com/chapter/10.1007/978-981-16-8987-1_73",
  "pdf_version_html_name": "",
  "pdf_version": "",
  "publication_code_html_name": "",
  "publication_code": "",
  "publication_video_demonstration_html_name": "",
  "publication_video_demonstration": "",
  "publish_abstract": true,
  "publication_abstract": "Algorithms proposed in this article aim to find all edges on any smallest route connecting two nodes of a directed acyclic graph (DAG). However, for a DAG with N nodes, the number of routes possible connecting any two nodes can be exponential. Hence, it is unfeasible to compute all the routes to attain the smallest ones in the polynomial-time and eventually produce a set of all edges that contribute or make any of the smallest routes. This article presents all the existing approaches to solve the problem, and we propose a new technique to compute the required edges by taking advantage of parallel computing using the C++ OpenMP API by parallelizing one of the existing approaches. We present a step-by-step procedure to convert a sequential algorithm into a parallel algorithm by identifying the parallelizable tasks. We also took advantage of parallel Dijkstra’s by using the nested parallelism feature of OpenMP and presented a technique for deciding the optimal number of threads to run the tasks that involve unbounded parallelism. Using parallel computing, we could achieve a speedup of over 13% for a complete graph. The techniques proposed here are not confined only to this particular use case. However, these have a more extensive scope in dynamic programming (DP), graph theory, and counting problems.",
  "footer": ""
}